
namespace LanguageConverter
{
    public class TextConverter
    {
        private readonly Dictionary<char, char> keyMapping = new Dictionary<char, char>
        {
            { 'a', 'ф' }, { 'b', 'и' }, { 'c', 'с' }, { 'd', 'в' }, { 'e', 'у' },
            { 'f', 'а' }, { 'g', 'п' }, { 'h', 'р' }, { 'i', 'ш' }, { 'j', 'о' },
            { 'k', 'л' }, { 'l', 'д' }, { 'm', 'ь' }, { 'n', 'т' }, { 'o', 'щ' },
            { 'p', 'з' }, { 'q', 'й' }, { 'r', 'к' }, { 's', 'і' }, { 't', 'е' },
            { 'u', 'г' }, { 'v', 'м' }, { 'w', 'ц' }, { 'x', 'ч' }, { 'y', 'н' },
            { 'z', 'я' }, { ';', 'ж' }, { '\'', 'є' }, { ',', 'б' }, { '.', 'ю' },
            { '[', 'х' }, { ']', 'ї' }, { '-', '-' }, { '`', 'ґ' }, { ' ', ' ' }, 
            { 'A', 'Ф' }, { 'B', 'И' }, { 'C', 'С' }, { 'D', 'В' }, { 'E', 'У' },
            { 'F', 'А' }, { 'G', 'П' }, { 'H', 'Р' }, { 'I', 'Ш' }, { 'J', 'О' },
            { 'K', 'Л' }, { 'L', 'Д' }, { 'M', 'Ь' }, { 'N', 'Т' }, { 'O', 'Щ' },
            { 'P', 'З' }, { 'Q', 'Й' }, { 'R', 'К' }, { 'S', 'І' }, { 'T', 'Е' },
            { 'U', 'Г' }, { 'V', 'М' }, { 'W', 'Ц' }, { 'X', 'Ч' }, { 'Y', 'Н' },
            { 'Z', 'Я' }, { ':', 'Ж' }, { '"', 'Є' }, { '<', 'Б' }, { '>', 'Ю' },
            { '{', 'Х' }, { '}', 'Ї' }, { '_', '_' }, { '~', 'Ґ' },
            { '!', '!' }, { '@', '"' }, { '#', '№' }, { '$', ';' }, { '%', '%' },
            { '^', ':' }, { '&', '?' }, { '*', '*' }, { '(', '(' }, { ')', ')' },
            { '+', '+' }, { '=', '=' }, { '\\', '/' }, { '|', '\\' },
            { '?', ',' }, { '/', '.' }
        };

        public string ConvertToUkrainian(string text)
        {
            var result = new char[text.Length];
            for (int i = 0; i < text.Length; i++)
            {
                char ch = text[i];
                result[i] = keyMapping.ContainsKey(ch) ? keyMapping[ch] : ch;
            }
            return new string(result);
        }
    }
}